---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudFilter.Dispose
source: html/0beddcdb-27b2-41c9-3bbe-4edbc1a0825f.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudFilter.Dispose Method

Releases all resources used by the PointCloudFilter

## Syntax (C#)
```csharp
public void Dispose()
```